NDuyQuy/stm32f051_ds1307_led7/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DIG_LED_Pin GPIO_PIN_0
#define DIG_LED_GPIO_Port GPIOC
#define DIG_LEDC1_Pin GPIO_PIN_1
#define DIG_LEDC1_GPIO_Port GPIOC
#define DIG_LEDC2_Pin GPIO_PIN_2
#define DIG_LEDC2_GPIO_Port GPIOC
#define DIG_LEDC3_Pin GPIO_PIN_3
#define DIG_LEDC3_GPIO_Port GPIOC
#define DIG_LEDC4_Pin GPIO_PIN_4
#define DIG_LEDC4_GPIO_Port GPIOC
#define DIG_LEDC5_Pin GPIO_PIN_5
#define DIG_LEDC5_GPIO_Port GPIOC
#define DIG_LEDC6_Pin GPIO_PIN_6
#define DIG_LEDC6_GPIO_Port GPIOC
#define DIG_LEDC7_Pin GPIO_PIN_7
#define DIG_LEDC7_GPIO_Port GPIOC
#define POWER_Pin GPIO_PIN_9
#define POWER_GPIO_Port GPIOA
#define POWERA10_Pin GPIO_PIN_10
#define POWERA10_GPIO_Port GPIOA
#define POWERA11_Pin GPIO_PIN_11
#define POWERA11_GPIO_Port GPIOA
#define POWERA12_Pin GPIO_PIN_12
#define POWERA12_GPIO_Port GPIOA
#define I2C_SCL_Pin GPIO_PIN_6
#define I2C_SCL_GPIO_Port GPIOB
#define I2C_SDA_Pin GPIO_PIN_7
#define I2C_SDA_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
